Revit 2024 API
WallType.ThermalProperties Property
 The calculated and settable thermal properties of the WallType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ThermalProperties ThermalProperties { get; }
Visual Basic
Public ReadOnly Property ThermalProperties As ThermalProperties
	Get
Visual C++
public:
property ThermalProperties^ ThermalProperties {
	ThermalProperties^ get ();
}
Remarks
 Returns null if the wall has no thermal properties. Curtain walls and stacked walls do not store thermal properties.
See Also
WallType Class
Autodesk.Revit.DB Namespace